//Задание 1
//Создайте переменную a. Запишите в нее значение 10, выведите его на экран с помощью метода alert (). Затем запишите в нее значение 20, выведите его на экран.

//let a = 10
//alert(a)

//a = 20
//alert(a)

//Задание 2
//Создайте переменную и присвойте ей значение года выпуска первого iPhone. Выведите значение переменной на экран.

//const firstIphoneYear = 2007
//alert(`Первый iphone был выпущен в ${firstIphoneYear}.`)

//Задание 3
//Создайте переменную и присвойте ей значение имени создателя языка JavaScript. Выведите значение переменной на экран.

//const jsCreator = 'Брендан Эйх'
//alert(`${jsCreator}-создатель языка программирования javascript.`)

//Задание 4
//Создайте две переменные 10 и 2. С помощью метода alert () выведите на экран их сумму, разность, произведение и частное (результат деления).

//a = 10
//let b = 2
//alert(`Переменная a=${a}, переменная b=${b}. a+b=${a+b}, a-b=${a-b},a*b=${a*b}, a/b=${a/b}.`)

//let result=2**5
//alert(`2^5=${result}`)

//Задание 6
//Даны переменные: a = 9 и b = 2. Найдите остаток от деления a на b и выведите результат на экран с помощью метода alert ().

// a=9
// b=2
// result=a%b
// alert(`Переменная a=${a}, переменная b=${b}. Остаток от деления a на b равен ${result}.`)

//Задание 7
//Перепишите код с использованием операторов присваивания и инкремента/декремента (количество строк должно остаться прежним):

//let num = 1;

//num = num + 5;

//num = num — 3;

//num = num * 7;

//num = num / 3;

//num = num + 1;

//num = num — 1;

//alert (num);

//let num = 1

//num += 5

//num -= 3

//num *= 7

//num /= 3

//num++

//num--

//alert(num)

//Задание 8
//Создайте переменную age, присвойте значение с помощью метода prompt () «Сколько вам лет?». Результат вывести с помощью alert ().

//let age = prompt('Сколько вам лет?')
//alert(age)

//Задание 9.0
//Создайте объект user, у которого есть следующие свойства: name, age, isAdmin. Значения для свойств придумайте произвольные. Обратите внимание, что для свойства name значение должно быть строковым, для age — числовым, а для isAdmin — булевым.

//Задание 9.1

//Добавьте объекту user свойство city of residence. Обратите внимание на то, как правильно добавлять такие методы: через точку или с помощью квадратных скобок.

//Задание 9.2

//Измените у объекта user свойство age на любое другое новое значение.

//Задание 9.3

//Удалите у объекта user свойство «city of residence».

//Задание 9.4

//Создайте переменную info, присвойте ей значение с помощью метода prompt () «Какую информацию хотите узнать о пользователе?».

//Далее обращайтесь к свойствам объекта user через переменную info. Выведите результат с помощью alert.

//const user = {
//    name: 'James Bond',
//    age: 45,
//    isAdmin: true,
//}

//user['city of residence'] = 'London'

//user.age +=2

//delete user['city of residence']

//const info = prompt('Какую информацию хотите узнать о пользователе?', 'name')

//alert(user[info])

//Задание 10
//С помощью метода prompt () спросите у пользователя его имя и сохраните в переменную. С помощью метода alert () выведите на экран шаблонную строку: Привет, ИМЯ!

//const name = prompt('Введите, пожалуйста, ваше имя.')
//alert(`Привет, ${name}!`)

